[
  {
    "news": "Ukrainian President Volodymyr Zelensky has announced the resignation of his influential chief of staff, Andriy Yermak, after anti-corruption authorities raided Yermak’s apartment in Kyiv amid a widening $100m embezzlement scandal. Although not personally accused, Yermak had come under intense political and public pressure, with recent polls showing 70% of Ukrainians calling for his departure. His exit comes at a critical moment as the United States, under President Trump, pushes a renewed effort to broker peace talks with Russia, and Zelensky warns the country against internal division that could weaken its negotiating position. Investigators have already implicated several top officials in the alleged kickback scheme involving state energy companies, alarming Ukraine’s Western allies as the country continues to seek EU membership. Yermak, long regarded as Zelensky’s closest adviser and a central figure in wartime diplomacy, had recently reiterated that Ukraine would not cede territory despite mounting U.S. pressure. His resignation marks a significant blow to Zelensky’s inner circle at a time when Russia is escalating demands and Ukrainian energy infrastructure faces renewed attacks heading into winter.",
    "images": [
      "dataset/images/zelenskey.png"
    ]
  },
  {
    "news": "A wave of anger is rising across Hong Kong after a catastrophic fire tore through the Wang Fuk Court subsidised housing estate, killing at least 128 people and leaving dozens critically injured in what many residents are calling a preventable, “man-made disaster.” Investigators say flammable mesh, plastic sheets and styrofoam blocks used during renovation works helped the blaze spread rapidly across seven of the estate’s eight high-rise towers, while residents report that fire alarms failed to sound because they had been switched off during construction. Three renovation supervisors have been arrested for manslaughter, and a corruption probe is under way as authorities inspect whether materials and scaffolding met safety standards. The tragedy, Hong Kong’s deadliest fire in more than six decades, has exposed long-standing concerns about poor building oversight, cost-cutting by contractors and the vulnerability of the city’s densely packed housing blocks. Many residents say they repeatedly warned about unsafe renovation practices, including workers smoking near apartments and the use of low-quality materials, but their complaints went unanswered. With hundreds evacuated and many still missing, criticism is mounting over systemic failures in estate management and regulatory enforcement, prompting authorities to order emergency inspections at all major repair sites across the city.",
    "images": [
      "dataset/images/hongkong.png"
    ]
  },
  {
    "news": "Fan disorder at European football matches is under renewed scrutiny after Aston Villa’s Europa League win over Young Boys was marred by objects thrown from the away end, injuring goalscorer Donyell Malen and prompting several arrests. The incident highlights broader concerns across Europe, where UEFA currently lists 116 suspended stadium bans tied to offences ranging from pyrotechnics and racist behaviour to crowd disturbances. Young Boys, who have a long disciplinary history and had only just come off probation for previous misbehaviour in England, now face fresh charges and likely financial penalties. The rise in fan disorder across Europe contrasts with improving records among English clubs, none of which feature in UEFA’s 132 active disciplinary cases, despite lingering reputational baggage and controversial policing incidents abroad. Questions are also being raised over inconsistent risk assessments, after Maccabi Tel Aviv were barred from having fans at Villa Park earlier this month due to security concerns linked to previous clashes, while Young Boys were allowed an allocation despite similar past issues. As UEFA weighs possible sanctions, critics argue that lenient fines—particularly for racist and discriminatory incidents—do little to deter misconduct, even as several nations face pending stadium closures for repeated offences.",
    "images": []
  },
  {
    "news": "Afghan communities across the United States have condemned the deadly Washington DC shooting that killed National Guard member Sarah Beckstrom and left another guardsman critically injured, stressing that the suspect—29-year-old Afghan migrant Rahmanullah Lakanwal—does not represent them. Lakanwal, who arrived under a special immigration programme for Afghans who assisted US forces during the 2021 Kabul evacuation, applied for and received asylum earlier this year; officials say he previously worked alongside US troops at Kabul airport. In response to the attack, President Donald Trump has halted all Afghan immigration processing, ordered a review of green cards issued to individuals from 19 countries, and threatened broader restrictions on migrants from what he labels “third-world countries.” Afghan residents told the BBC they were horrified by the incident and fear collective punishment, warning that political fallout is creating uncertainty for families already at risk from the Taliban. Community leaders urged Washington to avoid suspending visa pathways for those who supported the US mission in Afghanistan, citing two decades of cooperation. Advocates say many Afghans remain grateful for evacuation efforts but worry that abrupt policy shifts could endanger thousands still awaiting safe passage, with some fearing possible deportation or stalled asylum claims amid escalating political tensions.",
    "images": []
  },
  {
    "news": "France has agreed to begin intercepting small migrant boats in the English Channel after sustained pressure from the UK, marking a significant shift in its long-standing reluctance to intervene at sea. According to reporting in Le Monde, Prime Minister Sir Keir Starmer urged President Emmanuel Macron to back tougher tactics, arguing that current measures provide “no effective deterrent.” French maritime police confirmed they will now be permitted to stop boats before they collect passengers on the beaches of northern France—though they ruled out the use of nets previously suggested to disable engines. Until now, French officers rarely intervened due to safety risks and strict maritime policing rules, despite isolated attempts earlier this year. The decision follows months of stalled talks and operational challenges, with authorities still unclear on how the new interceptions will be safely carried out as smugglers adapt to changing enforcement. Weather conditions have already delayed the rollout. The UK welcomed the move, saying both countries are working to refine maritime tactics to curb illegal Channel crossings, which remain a politically contentious issue for both governments.",
    "images": [
      "dataset/images/uk.png"
    ]
  },
  {
    "news": "Two residents embroiled in a long-running dispute with the owners of Wyre Country Park in Lancashire saw their mobile homes destroyed by fires that broke out just 90 minutes apart, prompting police probes but leaving major questions unanswered. Mike Chesworth’s lodge was the first to go up in flames while he was away from the site, and as neighbours attempted to tackle the blaze, fellow resident Alison Porter-Garroch—who had come to help—soon discovered her own home burning on the opposite side of the park. Both had previously appeared in a BBC Panorama investigation alleging that the park’s operator, Exclusive Resorts Ltd, misled buyers into believing they could live at the holiday-only site year-round, costing some residents their life savings. The company strongly denied any suggestion of arson, saying Panorama’s coverage unfairly implied wrongdoing and noting that police had raised concerns about a possible insurance link to one of the fires. Lancashire Police later said both incidents were investigated as potential arson but no cause could be established and inquiries had been exhausted. Tensions at the park had escalated in the months before the fires, including disputes over electricity bills and eviction proceedings against the Chesworths, who were ordered to leave the day before their home burned down. Exclusive Resorts maintains it acted lawfully and cooperated fully with authorities, calling it “irresponsible” to infer baseless accusations against the company.",
    "images": []
  },
  {
    "news": "Australia captain Pat Cummins has been ruled out of the second Ashes Test in Brisbane as he continues to recover from a back injury, extending his absence after missing the side’s dramatic opening win over England in Perth. Despite bowling in the nets in both Perth and Sydney, the 32-year-old fast bowler has not completed the full return-to-play programme required for Test cricket, prompting selectors to retain an unchanged 14-man squad led once again by stand-in captain Steve Smith. Australia will also be without Josh Hazlewood, who remains sidelined with a hamstring injury, leaving Mitchell Starc, Scott Boland, Brendan Doggett, Cameron Green and Nathan Lyon as the likely attack for the day-night match at the Gabba. Questions remain over opener Usman Khawaja’s place after Travis Head’s exceptional century from the top of the order in Perth, while alternatives such as Josh Inglis or Michael Neser could come into contention if Australia reshuffle. Cummins will rejoin the squad in Brisbane as he targets a comeback in the third Test in Adelaide next month, while England have scheduled additional training sessions as they prepare for a venue where Australia have not lost an Ashes Test since 1986.",
    "images": [
      "dataset/images/ashes.png"
    ]
  },
  {
    "news": "Bristol Bears centre Benhard Janse van Rensburg will become eligible to play for England from November 2026 after World Rugby ruled that his brief 2016 appearance for South Africa’s Under-20 side no longer binds him to the Springboks at senior level. The 28-year-old, twice named in the Premiership team of the season, was originally deemed tied to South Africa because the U20s were classified as the nation’s “next senior representative team,” but a successful RFU appeal citing exceptional circumstances has cleared his qualification through the five-year residency route. Janse van Rensburg, who joined London Irish in 2021 before moving to Bristol following Irish’s collapse, played only 20 minutes for the Junior Boks as emergency cover and has never been considered for senior selection by Rassie Erasmus. His future availability expands an increasingly competitive England midfield picture, with Fraser Dingwall, Seb Atkinson, Max Ojomoh, Ollie Lawrence, Joe Marchant and the versatile Tommy Freeman all pushing for places under head coach Steve Borthwick. Janse van Rensburg could make his England debut against Australia in November 2026 before matches against Japan and New Zealand in the newly formed Nations Championship.",
    "images" : []
  },
  {
    "news": "At least 56 people have died and 21 remain missing in Sri Lanka after torrential monsoon rains triggered severe flooding and landslides across the country, marking one of its most devastating weather disasters in years. The worst tragedy occurred in the central district of Badulla, where a landslide buried homes overnight, killing 21 residents, while Cyclone Ditwah intensified conditions as it brushed past the island’s eastern coast. Dramatic videos captured houses being swept away by floodwaters as train services were halted, major roads closed and river levels—including the Kelani River near Colombo—continued to rise, prompting red-level flood warnings and mass evacuations. Lawmakers raised alarm in parliament over stranded passengers, including a bus marooned near the Kala Wewa reservoir, where military helicopters carried out multiple rescue missions, even airlifting a man who had spent the night atop a coconut tree. More than 44,000 people have been affected, with 20,500 army personnel deployed nationwide as schools postponed A-level exams due to the crisis. The disaster comes as Southeast Asia faces widespread flooding, with hundreds killed across Indonesia, Malaysia and Thailand, underscoring the scale of the region’s extreme weather emergency.",
    "images": []
  }
]